#### Terraform Format and Style 🖌`failure`
<details><summary>Formatting Output</summary>

```

main.tf

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>
            
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_app.api will be created
  + resource "azurerm_container_app" "api" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-api-fibonacci-sbx-uksouth-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fibonacci-sbx-uksouth-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Api"
        }

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 5000
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/api:14"
              + memory            = "1.5"
              + name              = "api"

              + env {
                  + name  = "REDIS_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = "6379"
                }
              + env {
                  + name  = "PGUSER"
                  + value = "psqladmin"
                }
              + env {
                  + name  = "PGHOST"
                  + value = "psql-fibonacci-sbx-uksouth-5ff115e9.postgres.database.azure.com"
                }
              + env {
                  + name  = "PGDATABASE"
                  + value = "postgres"
                }
              + env {
                  + name  = "PGPORT"
                  + value = "5432"
                }
              + env {
                  + name  = "PGPASSWORD"
                  + value = "p@ssw0rd!"
                }
            }
        }
    }

  # azurerm_container_app.client will be created
  + resource "azurerm_container_app" "client" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-client-fibonacci-sbx-uksouth-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fibonacci-sbx-uksouth-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Client"
        }

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 3000
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/client:14"
              + memory            = "1.5"
              + name              = "client"
            }
        }
    }

  # azurerm_container_app.nginx will be created
  + resource "azurerm_container_app" "nginx" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-nginx-fibonacci-sbx-uksouth-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fibonacci-sbx-uksouth-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "NGinx"
        }

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/nginx:14"
              + memory            = "1.5"
              + name              = "nginx"
            }
        }
    }

  # azurerm_container_app.worker will be created
  + resource "azurerm_container_app" "worker" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-worker-fibonacci-sbx-uksouth-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fibonacci-sbx-uksouth-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Worker"
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/worker:14"
              + memory            = "2.0"
              + name              = "worker"

              + env {
                  + name  = "REDIS_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = "6379"
                }
            }
        }
    }

  # azurerm_container_app_environment.this will be created
  + resource "azurerm_container_app_environment" "this" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/cae"
      + internal_load_balancer_enabled   = false
      + location                         = "uksouth"
      + mutual_tls_enabled               = false
      + name                             = "cae-fibonacci-sbx-uksouth-5ff115e9"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "rg-fibonacci-sbx-uksouth-5ff115e9"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Container App Environment"
        }
      + zone_redundancy_enabled          = false

      + workload_profile {
          + maximum_count         = 2
          + minimum_count         = 1
          + name                  = "fibonacci"
          + workload_profile_type = "Consumption"
        }
    }

  # azurerm_postgresql_flexible_server.this will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "this" {
        id                            = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-fibonacci-sbx-uksouth-5ff115e9"
        name                          = "psql-fibonacci-sbx-uksouth-5ff115e9"
      ~ sku_name                      = "GP_Standard_D4s_v3" -> "B_Standard_B1ms"
        tags                          = {}
      - zone                          = "1" -> null
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_private_dns_zone.redis will be created
  + resource "azurerm_private_dns_zone" "redis" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.redis.cache.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-fibonacci-sbx-uksouth-5ff115e9"

      + soa_record (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.redis will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "redis" {
      + id                    = (known after apply)
      + name                  = "redis"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-fibonacci-sbx-uksouth-5ff115e9"
      + virtual_network_id    = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9"
    }

  # azurerm_redis_cache.this must be replaced
-/+ resource "azurerm_redis_cache" "this" {
      ~ family                        = "P" -> "C"
      ~ hostname                      = "redis-fibonacci-sbx-uksouth-5ff115e9.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Cache/redis/redis-fibonacci-sbx-uksouth-5ff115e9" -> (known after apply)
        name                          = "redis-fibonacci-sbx-uksouth-5ff115e9"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      ~ private_static_ip_address     = "192.168.10.4" -> (known after apply)
      ~ redis_version                 = "6.0" -> (known after apply)
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ sku_name                      = "Premium" -> "Basic" # forces replacement
      ~ ssl_port                      = 6380 -> (known after apply)
      - tags                          = {} -> null
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          ~ maxclients                              = 7500 -> (known after apply)
          ~ maxfragmentationmemory_reserved         = 642 -> (known after apply)
          ~ maxmemory_delta                         = 642 -> (known after apply)
          ~ maxmemory_reserved                      = 642 -> (known after apply)
          - rdb_backup_enabled                      = false -> null
          - rdb_backup_frequency                    = 0 -> null
          - rdb_backup_max_snapshot_count           = 0 -> null
            # (8 unchanged attributes hidden)
        }
    }

  # azurerm_subnet.psql will be updated in-place
  ~ resource "azurerm_subnet" "psql" {
        id                                             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fibonacci-sbx-uksouth-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fibonacci-sbx-uksouth-5ff115e9/subnets/psql"
        name                                           = "psql"
        # (11 unchanged attributes hidden)

      ~ delegation {
            name = "psql"

          ~ service_delegation {
              ~ actions = [
                  ~ "Microsoft.Network/virtualNetworks/subnets/join/action" -> "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

Plan: 8 to add, 2 to change, 1 to destroy.

```

</details>

Pusher: @heathen1878
Action: pull_request
Workflow: Validate Fibonacci Infrastructure